app/Filters/Rbac.php

    public static function userCan(string $permission, string $menuUrl): bool
    {
        $userId = session()->get('user_id');
         // Normalize the input menuUrl to handle both '/path' and 'path'
        $normalizedMenuUrl = trim($menuUrl, '/');
        if (!$userId) {
            return false;
        }

        // Langkah 1: Ambil role user, HANYA SEKALI per request
        if (self::$userRoles === null) {
            $userRoleModel = new \App\Models\UserRoleModel();
            self::$userRoles = $userRoleModel->where('user_id', $userId)->findAll();
---
SELECT *
FROM `user_roles`
WHERE `user_id` = '1'