app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `user_roles`
WHERE `user_id` = '1'
---
    public function auth()
    {
        $session = session();
        // Validasi input
        $username = trim($this->request->getPost('username'));
        $password = $this->request->getPost('password');
        if (!$username || !$password) {
            return redirect()->back()->with('error', 'Username dan password wajib diisi.');
        }

        // Ambil user dari database
        $userModel = new UserModel();
        $user = $userModel->where('username', $username)->first();

        if ($user && password_verify($password, $user['password_hash'])) {
            // KRUSIAL: Periksa apakah user aktif
            if ($user['is_active'] != 1) {
                $session->setFlashdata('error', 'Akun Anda tidak aktif. Silakan hubungi administrator.');
                return redirect()->back()->withInput();
            }

            // Ambil role_id dari tabel user_roles
            $userRoleModel = model(\App\Models\UserRoleModel::class);
            $userRoles = $userRoleModel->where('user_id', $user['id'])->findAll();

SELECT *
FROM `roles`
WHERE `roles`.`deleted_at` IS NULL
AND `roles`.`id` = '1'
---
            $roleName = 'N/A'; // Nilai default jika role tidak ditemukan
            if ($mainRoleId) {
                $roleModel = model(\App\Models\RoleModel::class);
                $role = $roleModel->find($mainRoleId);

UPDATE `users` SET `last_login_at` = '2025-06-26 14:28:30', `updated_at` = '2025-06-26 14:28:30'
WHERE `users`.`id` IN ('1')
---
            ]);

            // (Best Practice) Update last login timestamp
            $userModel->update($user['id'], ['last_login_at' => date('Y-m-d H:i:s')]);