app/Controllers/MenuController.php

SELECT *
FROM `menu`
WHERE `menu`.`deleted_at` IS NULL
ORDER BY `sort_order` ASC
---
    public function index()
    {
        $menuModel = new MenuModel();

        // Ambil semua menu dan bangun struktur pohon
        $allMenus = $menuModel->orderBy('sort_order', 'ASC')->findAll();