app/Controllers/RoleController.php

    public function index()
    {
        $roleModel = new RoleModel();
        $menuModel = new MenuModel(); // Digunakan untuk mengambil semua menu

        $data = [
            'roles' => $roleModel->findAll(),
            // Ambil semua menu untuk modal "Kelola Menu".
            // Kecualikan menu 'Dashboard' dan 'Change Password' karena tidak memerlukan
            // pengaturan hak akses granular (biasanya tersedia untuk semua user yang login).
            'menus' => $menuModel->whereNotIn('url', [
                                        '/dashboard',
                                        '/password/change'
                                    ])
                                  ->orderBy('parent_id', 'ASC')
                                  ->orderBy('sort_order', 'ASC')
                                  ->findAll(),
---
SELECT *
FROM `menu`
WHERE `url` NOT IN ('/dashboard','/password/change')
AND `menu`.`deleted_at` IS NULL
ORDER BY `parent_id` ASC, `sort_order` ASC

    public function getRoleMenus($roleId)
    {
        // --- RBAC Check: Only allow if user can update roles ---
        if (!Rbac::userCan('can_update', '/setting/roles')) {
            return $this->response->setStatusCode(403)->setJSON(['error' => 'Akses ditolak']);
        }

        $roleMenuModel = new RoleMenuModel();
        $permissions = $roleMenuModel->where('role_id', $roleId)->findAll();
---
SELECT *
FROM `role_menus`
WHERE `role_id` = '4'