app/Controllers/UserController.php

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `users`.`id`, `users`.`username`, `users`.`email`, `users`.`name` AS `nama_lengkap`, `users`.`is_active`, GROUP_CONCAT(roles.name SEPARATOR ", ") as roles, GROUP_CONCAT(roles.id SEPARATOR ", ") as role_ids
FROM `users`
LEFT JOIN `user_roles` ON `user_roles`.`user_id` = `users`.`id`
LEFT JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id`
WHERE `users`.`deleted_at` IS NULL
GROUP BY `users`.`id`
) CI_count_all_results
SELECT `users`.`id`, `users`.`username`, `users`.`email`, `users`.`name` AS `nama_lengkap`, `users`.`is_active`, GROUP_CONCAT(roles.name SEPARATOR ", ") as roles, GROUP_CONCAT(roles.id SEPARATOR ", ") as role_ids
FROM `users`
LEFT JOIN `user_roles` ON `user_roles`.`user_id` = `users`.`id`
LEFT JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id`
WHERE `users`.`deleted_at` IS NULL
GROUP BY `users`.`id`
 LIMIT 10
---
    public function index()
    {
        $userModel = new UserModel();
        $roleModel = new RoleModel();

        $perPage = 10; // Jumlah user per halaman
        $search = $this->request->getGet('search');
        $page = $this->request->getGet('page') ?? 1; // Gunakan 'page' sebagai parameter umum untuk AJAX

        $builder = $userModel->select('users.id, users.username, users.email, users.name AS nama_lengkap, users.is_active, GROUP_CONCAT(roles.name SEPARATOR ", ") as roles, GROUP_CONCAT(roles.id SEPARATOR ",") as role_ids')
                               ->join('user_roles', 'user_roles.user_id = users.id', 'left')
                               ->join('roles', 'roles.id = user_roles.role_id', 'left')
                               ->groupBy('users.id');

        // Terapkan filter pencarian jika ada istilah pencarian
        if (!empty($search)) {
            $builder->like('users.username', $search)
                      ->orLike('users.email', $search)
                      ->orLike('users.name', $search)
                      ->orLike('roles.name', $search);
        }

        $users = $builder->paginate($perPage, 'default', $page);

SELECT *
FROM `roles`
WHERE `roles`.`deleted_at` IS NULL
---
        $data = [
            'users' => $users,
            'pager' => $pager,
            'roles' => $roleModel->findAll(), // Untuk pilihan di modal