app/Models/MenuModel.php

SELECT `menu`.`id`, `menu`.`name`, `menu`.`url`, `menu`.`icon`, `menu`.`parent_id`, `menu`.`sort_order`, `menu`.`is_active`, `menu`.`is_visible`, `rm`.`can_view`
FROM `menu` AS `menu`
LEFT JOIN `role_menus` AS `rm` ON `rm`.`menu_id` = `menu`.`id` AND `rm`.`role_id` = 1
WHERE `menu`.`is_active` = 1
AND `menu`.`is_visible` = 1
AND `menu`.`deleted_at` IS NULL
ORDER BY `menu`.`parent_id` ASC, `menu`.`sort_order` ASC
---
    public function getSidebarMenus(?int $roleId = null): array
    {
        if (is_null($roleId)) {
            return []; // Jika user tidak punya role, kembalikan menu dinamis kosong
        }

        // A list of URLs that should always be visible, regardless of role_menus configuration.
        $alwaysVisibleUrls = ['/dashboard', '/password/change'];

        // 1. Fetch all active and visible menus.
        //    Perform a LEFT JOIN with role_menus to get role-specific permissions.
        //    A LEFT JOIN is used to ensure all menus are retrieved, even if they don't have an entry in role_menus.
        $builder = $this->db->table($this->table . ' AS menu');
        $builder->select('menu.id, menu.name, menu.url, menu.icon, menu.parent_id, menu.sort_order, menu.is_active, menu.is_visible, rm.can_view');
        $builder->join('role_menus AS rm', 'rm.menu_id = menu.id AND rm.role_id = ' . $this->db->escape($roleId), 'left');
        $builder->where('menu.is_active', 1);
        $builder->where('menu.is_visible', 1); // Pastikan menu memang dimaksudkan untuk ditampilkan
        $builder->where('menu.deleted_at', null); // KRUSIAL: Hanya ambil menu yang tidak di-soft-delete
        $builder->orderBy('menu.parent_id', 'ASC');
        $builder->orderBy('menu.sort_order', 'ASC');

        $allMenusWithPermissions = $builder->get()->getResultArray();